Revit 2027 API
ImagePlacementOptions.PlacementPoint Property
 Identifies which point of the ImageInstance will be aligned to the Location
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoxPlacement PlacementPoint { get; set; }
Public Property PlacementPoint As BoxPlacement
	Get
	Set
public:
property BoxPlacement PlacementPoint {
	BoxPlacement get ();
	void set (BoxPlacement value);
}
member PlacementPoint : BoxPlacement with get, set
Property Value
BoxPlacement
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The location of the corners of the image in the model depends on the size and orientation of the ImageInstance and the orientation of the view it is placed in.
See Also
Reference
ImagePlacementOptions Class
Autodesk.Revit.DB Namespace